app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.all_ratings
    @range = @all_ratings
    if params['commit'] then
      @range = @all_ratings.select {|rating| rating if params['rating'][rating.to_sym]}
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')